#### Cluster ☸️ `Production`

#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cluster-late[0].google_logging_project_bucket_config.nginx_ingress will be created
  + resource "google_logging_project_bucket_config" "nginx_ingress" {
      + bucket_id       = "nginx-ingress"
      + description     = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + location        = "global"
      + name            = (known after apply)
      + project         = "rkgke-prod-03"
      + retention_days  = 30
    }

  # module.cluster-late[0].google_logging_project_bucket_config.pod_label["14"] will be created
  + resource "google_logging_project_bucket_config" "pod_label" {
      + bucket_id       = "keep-logs-14-days"
      + description     = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + location        = "global"
      + name            = (known after apply)
      + project         = "rkgke-prod-03"
      + retention_days  = 14
    }

  # module.cluster-late[0].google_logging_project_bucket_config.pod_label["30"] will be created
  + resource "google_logging_project_bucket_config" "pod_label" {
      + bucket_id       = "keep-logs-30-days"
      + description     = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + location        = "global"
      + name            = (known after apply)
      + project         = "rkgke-prod-03"
      + retention_days  = 30
    }

  # module.cluster-late[0].google_logging_project_bucket_config.pod_label["60"] will be created
  + resource "google_logging_project_bucket_config" "pod_label" {
      + bucket_id       = "keep-logs-60-days"
      + description     = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + location        = "global"
      + name            = (known after apply)
      + project         = "rkgke-prod-03"
      + retention_days  = 60
    }

  # module.cluster-late[0].google_logging_project_bucket_config.pod_label["7"] will be created
  + resource "google_logging_project_bucket_config" "pod_label" {
      + bucket_id       = "keep-logs-7-days"
      + description     = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + location        = "global"
      + name            = (known after apply)
      + project         = "rkgke-prod-03"
      + retention_days  = 7
    }

  # module.cluster-late[0].google_logging_project_bucket_config.pod_label["90"] will be created
  + resource "google_logging_project_bucket_config" "pod_label" {
      + bucket_id       = "keep-logs-90-days"
      + description     = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + location        = "global"
      + name            = (known after apply)
      + project         = "rkgke-prod-03"
      + retention_days  = 90
    }

  # module.cluster-late[0].google_logging_project_exclusion.nginx_ingress will be created
  + resource "google_logging_project_exclusion" "nginx_ingress" {
      + description = "Exclude nginx-ingress namespace logs. Stored elsewhere."
      + filter      = "resource.type = k8s_container resource.labels.namespace_name=\"nginx-ingress\" "
      + id          = (known after apply)
      + name        = "nginx-ingress"
      + project     = (known after apply)
    }

  # module.cluster-late[0].google_logging_project_exclusion.pod_label["14"] will be created
  + resource "google_logging_project_exclusion" "pod_label" {
      + description = "Exclude Pod-labelled logs. Stored elsewhere."
      + filter      = "resource.type = k8s_container labels.\"k8s-pod/rkways_com/gke-infra-logdays\" = \"14\" "
      + id          = (known after apply)
      + name        = "keep-logs-14-days"
      + project     = (known after apply)
    }

  # module.cluster-late[0].google_logging_project_exclusion.pod_label["30"] will be created
  + resource "google_logging_project_exclusion" "pod_label" {
      + description = "Exclude Pod-labelled logs. Stored elsewhere."
      + filter      = "resource.type = k8s_container labels.\"k8s-pod/rkways_com/gke-infra-logdays\" = \"30\" "
      + id          = (known after apply)
      + name        = "keep-logs-30-days"
      + project     = (known after apply)
    }

  # module.cluster-late[0].google_logging_project_exclusion.pod_label["60"] will be created
  + resource "google_logging_project_exclusion" "pod_label" {
      + description = "Exclude Pod-labelled logs. Stored elsewhere."
      + filter      = "resource.type = k8s_container labels.\"k8s-pod/rkways_com/gke-infra-logdays\" = \"60\" "
      + id          = (known after apply)
      + name        = "keep-logs-60-days"
      + project     = (known after apply)
    }

  # module.cluster-late[0].google_logging_project_exclusion.pod_label["7"] will be created
  + resource "google_logging_project_exclusion" "pod_label" {
      + description = "Exclude Pod-labelled logs. Stored elsewhere."
      + filter      = "resource.type = k8s_container labels.\"k8s-pod/rkways_com/gke-infra-logdays\" = \"7\" "
      + id          = (known after apply)
      + name        = "keep-logs-7-days"
      + project     = (known after apply)
    }

  # module.cluster-late[0].google_logging_project_exclusion.pod_label["90"] will be created
  + resource "google_logging_project_exclusion" "pod_label" {
      + description = "Exclude Pod-labelled logs. Stored elsewhere."
      + filter      = "resource.type = k8s_container labels.\"k8s-pod/rkways_com/gke-infra-logdays\" = \"90\" "
      + id          = (known after apply)
      + name        = "keep-logs-90-days"
      + project     = (known after apply)
    }

  # module.cluster-late[0].google_logging_project_sink.nginx_ingress will be created
  + resource "google_logging_project_sink" "nginx_ingress" {
      + destination            = (known after apply)
      + filter                 = "resource.type = k8s_container resource.labels.namespace_name=\"nginx-ingress\" "
      + id                     = (known after apply)
      + name                   = "nginx-ingress"
      + project                = (known after apply)
      + unique_writer_identity = true
      + writer_identity        = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.cluster-late[0].google_logging_project_sink.pod_label["14"] will be created
  + resource "google_logging_project_sink" "pod_label" {
      + destination            = (known after apply)
      + filter                 = "resource.type = k8s_container labels.\"k8s-pod/rkways_com/gke-infra-logdays\" = \"14\" "
      + id                     = (known after apply)
      + name                   = "keep-logs-14-days"
      + project                = (known after apply)
      + unique_writer_identity = true
      + writer_identity        = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.cluster-late[0].google_logging_project_sink.pod_label["30"] will be created
  + resource "google_logging_project_sink" "pod_label" {
      + destination            = (known after apply)
      + filter                 = "resource.type = k8s_container labels.\"k8s-pod/rkways_com/gke-infra-logdays\" = \"30\" "
      + id                     = (known after apply)
      + name                   = "keep-logs-30-days"
      + project                = (known after apply)
      + unique_writer_identity = true
      + writer_identity        = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.cluster-late[0].google_logging_project_sink.pod_label["60"] will be created
  + resource "google_logging_project_sink" "pod_label" {
      + destination            = (known after apply)
      + filter                 = "resource.type = k8s_container labels.\"k8s-pod/rkways_com/gke-infra-logdays\" = \"60\" "
      + id                     = (known after apply)
      + name                   = "keep-logs-60-days"
      + project                = (known after apply)
      + unique_writer_identity = true
      + writer_identity        = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.cluster-late[0].google_logging_project_sink.pod_label["7"] will be created
  + resource "google_logging_project_sink" "pod_label" {
      + destination            = (known after apply)
      + filter                 = "resource.type = k8s_container labels.\"k8s-pod/rkways_com/gke-infra-logdays\" = \"7\" "
      + id                     = (known after apply)
      + name                   = "keep-logs-7-days"
      + project                = (known after apply)
      + unique_writer_identity = true
      + writer_identity        = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.cluster-late[0].google_logging_project_sink.pod_label["90"] will be created
  + resource "google_logging_project_sink" "pod_label" {
      + destination            = (known after apply)
      + filter                 = "resource.type = k8s_container labels.\"k8s-pod/rkways_com/gke-infra-logdays\" = \"90\" "
      + id                     = (known after apply)
      + name                   = "keep-logs-90-days"
      + project                = (known after apply)
      + unique_writer_identity = true
      + writer_identity        = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @kupson, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*